<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"fd470d8d152544660c29762282ad7cf29dda0c4b85f8acf6d13fa0da4fad7b23","plan_job_ref":"Job .github/workflows/_test-tf.yaml #138 at https://github.com/DND-IT/github-workflows/actions/runs/17519437175","plan_out_hash":"0c4563d442a1b5bba8b2d8fe34e78a2bdff0a44f58b78b78ca406e17f0447b64","plan_hash":"3070d9ebb2b2785eb94485991579845930d11ca7e1e62d200ad4bf221947eb26","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #138](https://github.com/DND-IT/github-workflows/actions/runs/17519437175)